app/controllers/products_controller.rb

INSERT INTO "products" ("title", "description", "image_url", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "Iphone6 Plus"], ["description", "New iphone"], ["image_url", "/images/iphone6_plus.jpg"], ["created_at", "2015-03-28 14:25:37.673977"], ["updated_at", "2015-03-28 14:25:37.673977"]]
---
  def create
    @product = Product.new(product_params)

    respond_to do |format|
      if @product.save

UPDATE "products" SET "image_url" = ?, "updated_at" = ? WHERE "products"."id" = ?  [["image_url", "/images/rails.png"], ["updated_at", "2015-04-05 13:25:46.526152"], ["id", 10]]
---
  def update
    respond_to do |format|
      if @product.update(product_params)