app/controllers/store_controller.rb

  def index
  	@products = Product.find_products_for_sale
---
SELECT "products".* FROM "products"